nguyentri/da-pac/svd/DA14680.svd
	<register>
	  <name>ICPR</name>
	  <description>Interrupt clear-pending register</description>
	  <addressOffset>0x00000180</addressOffset>
	  <size>32</size>
	  <access>read-write</access>
	  <resetValue>0x00000000</resetValue>
	  <resetMask>0xffffffff</resetMask>
	  <fields>
		<field>
		  <name>BLE_WAKEUP_LP_IRQn</name>
		  <description>BLE_WAKEUP_LP_IRQn (Interrupt clear-pending bit)</description>
		  <bitRange>[0:0]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>BLE_GEN_IRQn</name>
		  <description>BLE_GEN_IRQn (Interrupt clear-pending bit)</description>
		  <bitRange>[1:1]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>FTDF_WAKEUP_IRQn</name>
		  <description>FTDF_WAKEUP_IRQn (Interrupt clear-pending bit)</description>
		  <bitRange>[2:2]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>FTDF_GEN_IRQn</name>
		  <description>FTDF_GEN_IRQn (Interrupt clear-pending bit)</description>
		  <bitRange>[3:3]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>RFCAL_IRQn</name>
		  <description>RFCAL_IRQn (Interrupt clear-pending bit)</description>
		  <bitRange>[4:4]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>COEX_IRQn</name>
		  <description>COEX_IRQn (Interrupt clear-pending bit)</description>
		  <bitRange>[5:5]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>CRYPTO_IRQn</name>
		  <description>CRYPTO_IRQn (Interrupt clear-pending bit)</description>
		  <bitRange>[6:6]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>MRM_IRQn</name>
		  <description>MRM_IRQn (Interrupt clear-pending bit)</description>
		  <bitRange>[7:7]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>UART_IRQn</name>
		  <description>UART_IRQn (Interrupt clear-pending bit)</description>
		  <bitRange>[8:8]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>UART2_IRQn</name>
		  <description>UART2_IRQn (Interrupt clear-pending bit)</description>
		  <bitRange>[9:9]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>I2C_IRQn</name>
		  <description>I2C_IRQn (Interrupt clear-pending bit)</description>
		  <bitRange>[10:10]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>I2C2_IRQn</name>
		  <description>I2C2_IRQn (Interrupt clear-pending bit)</description>
		  <bitRange>[11:11]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>SPI_IRQn</name>
		  <description>SPI_IRQn (Interrupt clear-pending bit)</description>
		  <bitRange>[12:12]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>SPI2_IRQn</name>
		  <description>SPI2_IRQn (Interrupt clear-pending bit)</description>
		  <bitRange>[13:13]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>ADC_IRQn</name>
		  <description>ADC_IRQn (Interrupt clear-pending bit)</description>
		  <bitRange>[14:14]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>KEYBRD_IRQn</name>
		  <description>KEYBRD_IRQn (Interrupt clear-pending bit)</description>
		  <bitRange>[15:15]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>IRGEN_IRQn</name>
		  <description>IRGEN_IRQn (Interrupt clear-pending bit)</description>
		  <bitRange>[16:16]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>WKUP_GPIO_IRQn</name>
		  <description>WKUP_GPIO_IRQn (Interrupt clear-pending bit)</description>
		  <bitRange>[17:17]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>SWTIM0_IRQn</name>
		  <description>SWTIM0_IRQn (Interrupt clear-pending bit)</description>
		  <bitRange>[18:18]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>SWTIM1_IRQn</name>
		  <description>SWTIM1_IRQn (Interrupt clear-pending bit)</description>
		  <bitRange>[19:19]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>QUADEC_IRQn</name>
		  <description>QUADEC_IRQn (Interrupt clear-pending bit)</description>
		  <bitRange>[20:20]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>USB_IRQn</name>
		  <description>USB_IRQn (Interrupt clear-pending bit)</description>
		  <bitRange>[21:21]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>PCM_IRQn</name>
		  <description>PCM_IRQn (Interrupt clear-pending bit)</description>
		  <bitRange>[22:22]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>SRC_IN_IRQn</name>
		  <description>SRC_IN_IRQn (Interrupt clear-pending bit)</description>
		  <bitRange>[23:23]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>SRC_OUT_IRQn</name>
		  <description>SRC_OUT_IRQn (Interrupt clear-pending bit)</description>
		  <bitRange>[24:24]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>VBUS_IRQn</name>
		  <description>VBUS_IRQn (Interrupt clear-pending bit)</description>
		  <bitRange>[25:25]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>DMA_IRQn</name>
		  <description>DMA_IRQn (Interrupt clear-pending bit)</description>
		  <bitRange>[26:26]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>RF_DIAG_IRQn</name>
		  <description>RF_DIAG_IRQn (Interrupt clear-pending bit)</description>
		  <bitRange>[27:27]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>TRNG_IRQn</name>
		  <description>TRNG_IRQn (Interrupt clear-pending bit)</description>
		  <bitRange>[28:28]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>DCDC_IRQn</name>
		  <description>DCDC_IRQn (Interrupt clear-pending bit)</description>
		  <bitRange>[29:29]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>XTAL16RDY_IRQn</name>
		  <description>XTAL16RDY_IRQn (Interrupt clear-pending bit)</description>
		  <bitRange>[30:30]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>Rsvd__irq__n</name>
		  <description>Rsvd__irq__n (Reserved)</description>
		  <bitRange>[31:31]</bitRange>
		  <access>read-write</access>
		</field>
	  </fields>
	</register>
	<register>
	  <name>IPR0</name>
	  <description>Interrupt priority register 0</description>
	  <addressOffset>0x00000300</addressOffset>
	  <size>32</size>
	  <access>read-write</access>
	  <resetValue>0x00000000</resetValue>
	  <resetMask>0xffffffff</resetMask>
	  <fields>
		<field>
		  <name>BLE_WAKEUP_LP_IRQn_prio</name>
		  <description>BLE_WAKEUP_LP_IRQn[7:0] bits (Interrupt priority)</description>
		  <bitRange>[7:0]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>BLE_GEN_IRQn_prio</name>
		  <description>BLE_GEN_IRQn[7:0] bits (Interrupt priority)</description>
		  <bitRange>[15:8]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>FTDF_WAKEUP_IRQn_prio</name>
		  <description>FTDF_WAKEUP_IRQn[7:0] bits (Interrupt priority)</description>
		  <bitRange>[23:16]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>FTDF_GEN_IRQn_prio</name>
		  <description>FTDF_GEN_IRQn[7:0] bits (Interrupt priority)</description>
		  <bitRange>[31:24]</bitRange>
		  <access>read-write</access>
		</field>
	  </fields>
	</register>
	<register>
	  <name>IPR1</name>
	  <description>Interrupt priority register 1</description>
	  <addressOffset>0x00000304</addressOffset>
	  <size>32</size>
	  <access>read-write</access>
	  <resetValue>0x00000000</resetValue>
	  <resetMask>0xffffffff</resetMask>
	  <fields>
		<field>
		  <name>RFCAL_IRQn_prio</name>
		  <description>RFCAL_IRQn[7:0] bits (Interrupt priority)</description>
		  <bitRange>[7:0]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>COEX_IRQn_prio</name>
		  <description>COEX_IRQn[7:0] bits (Interrupt priority)</description>
		  <bitRange>[15:8]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>CRYPTO_IRQn_prio</name>
		  <description>CRYPTO_IRQn[7:0] bits (Interrupt priority)</description>
		  <bitRange>[23:16]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>MRM_IRQn_prio</name>
		  <description>MRM_IRQn[7:0] bits (Interrupt priority)</description>
		  <bitRange>[31:24]</bitRange>
		  <access>read-write</access>
		</field>
	  </fields>
	</register>
	<register>
	  <name>IPR2</name>
	  <description>Interrupt priority register 2</description>
	  <addressOffset>0x00000308</addressOffset>
	  <size>32</size>
	  <access>read-write</access>
	  <resetValue>0x00000000</resetValue>
	  <resetMask>0xffffffff</resetMask>
	  <fields>
		<field>
		  <name>UART_IRQn_prio</name>
		  <description>UART_IRQn[7:0] bits (Interrupt priority)</description>
		  <bitRange>[7:0]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>UART2_IRQn_prio</name>
		  <description>UART2_IRQn[7:0] bits (Interrupt priority)</description>
		  <bitRange>[15:8]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>I2C_IRQn_prio</name>
		  <description>I2C_IRQn[7:0] bits (Interrupt priority)</description>
		  <bitRange>[23:16]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>I2C2_IRQn_prio</name>
		  <description>I2C2_IRQn[7:0] bits (Interrupt priority)</description>
		  <bitRange>[31:24]</bitRange>
		  <access>read-write</access>
		</field>
	  </fields>
	</register>
	<register>
	  <name>IPR3</name>
	  <description>Interrupt priority register 3</description>
	  <addressOffset>0x0000030C</addressOffset>
	  <size>32</size>
	  <access>read-write</access>
	  <resetValue>0x00000000</resetValue>
	  <resetMask>0xffffffff</resetMask>
	  <fields>
		<field>
		  <name>SPI_IRQn_prio</name>
		  <description>SPI_IRQn[7:0] bits (Interrupt priority)</description>
		  <bitRange>[7:0]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>SPI2_IRQn_prio</name>
		  <description>SPI2_IRQn[7:0] bits (Interrupt priority)</description>
		  <bitRange>[15:8]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>ADC_IRQn_prio</name>
		  <description>ADC_IRQn[7:0] bits (Interrupt priority)</description>
		  <bitRange>[23:16]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>KEYBRD_IRQn_prio</name>
		  <description>KEYBRD_IRQn[7:0] bits (Interrupt priority)</description>
		  <bitRange>[31:24]</bitRange>
		  <access>read-write</access>
		</field>
	  </fields>
	</register>
	<register>
	  <name>IPR4</name>
	  <description>Interrupt priority register 4</description>
	  <addressOffset>0x00000310</addressOffset>
	  <size>32</size>
	  <access>read-write</access>
	  <resetValue>0x00000000</resetValue>
	  <resetMask>0xffffffff</resetMask>
	  <fields>
		<field>
		  <name>IRGEN_IRQn_prio</name>
		  <description>IRGEN_IRQn[7:0] bits (Interrupt priority)</description>
		  <bitRange>[7:0]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>WKUP_GPIO_IRQn_prio</name>
		  <description>WKUP_GPIO_IRQn[7:0] bits (Interrupt priority)</description>
		  <bitRange>[15:8]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>SWTIM0_IRQn_prio</name>
		  <description>SWTIM0_IRQn[7:0] bits (Interrupt priority)</description>
		  <bitRange>[23:16]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>SWTIM1_IRQn_prio</name>
		  <description>SWTIM1_IRQn[7:0] bits (Interrupt priority)</description>
		  <bitRange>[31:24]</bitRange>
		  <access>read-write</access>
		</field>
	  </fields>
	</register>
	<register>
	  <name>IPR5</name>
	  <description>Interrupt priority register 5</description>
	  <addressOffset>0x00000314</addressOffset>
	  <size>32</size>
	  <access>read-write</access>
	  <resetValue>0x00000000</resetValue>
	  <resetMask>0xffffffff</resetMask>
	  <fields>
		<field>
		  <name>QUADEC_IRQn_prio</name>
		  <description>QUADEC_IRQn[7:0] bits (Interrupt priority)</description>
		  <bitRange>[7:0]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>USB_IRQn_prio</name>
		  <description>USB_IRQn[7:0] bits (Interrupt priority)</description>
		  <bitRange>[15:8]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>PCM_IRQn_prio</name>
		  <description>PCM_IRQn[7:0] bits (Interrupt priority)</description>
		  <bitRange>[23:16]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>SRC_IN_IRQn_prio</name>
		  <description>SRC_IN_IRQn[7:0] bits (Interrupt priority)</description>
		  <bitRange>[31:24]</bitRange>
		  <access>read-write</access>
		</field>
	  </fields>
	</register>
	<register>
	  <name>IPR6</name>
	  <description>Interrupt priority register 6</description>
	  <addressOffset>0x00000318</addressOffset>
	  <size>32</size>
	  <access>read-write</access>
	  <resetValue>0x00000000</resetValue>
	  <resetMask>0xffffffff</resetMask>
	  <fields>
		<field>
		  <name>SRC_OUT_IRQn_prio</name>
		  <description>SRC_OUT_IRQn[7:0] bits (Interrupt priority)</description>
		  <bitRange>[7:0]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>VBUS_IRQn_prio</name>
		  <description>VBUS_IRQn[7:0] bits (Interrupt priority)</description>
		  <bitRange>[15:8]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>DMA_IRQn_prio</name>
		  <description>DMA_IRQn[7:0] bits (Interrupt priority)</description>
		  <bitRange>[23:16]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>RF_DIAG_IRQn_prio</name>
		  <description>RF_DIAG_IRQn[7:0] bits (Interrupt priority)</description>
		  <bitRange>[31:24]</bitRange>
		  <access>read-write</access>
		</field>
	  </fields>
	</register>
	<register>
	  <name>IPR7</name>
	  <description>Interrupt priority register 7</description>
	  <addressOffset>0x0000031C</addressOffset>
	  <size>32</size>
	  <access>read-write</access>
	  <resetValue>0x00000000</resetValue>
	  <resetMask>0xffffffff</resetMask>
	  <fields>
		<field>
		  <name>TRNG_IRQn_prio</name>
		  <description>TRNG_IRQn[7:0] bits (Interrupt priority)</description>
		  <bitRange>[7:0]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>DCDC_IRQn_prio</name>
		  <description>DCDC_IRQn[7:0] bits (Interrupt priority)</description>
		  <bitRange>[15:8]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>XTAL16RDY_IRQn_prio</name>
		  <description>XTAL16RDY_IRQn[7:0] bits (Interrupt priority)</description>
		  <bitRange>[23:16]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>RESERVED31_IRQn_DONT_USE</name>
		  <description>RESERVED31_IRQn[7:0] bits (Reserved)</description>
		  <bitRange>[31:24]</bitRange>
		  <access>read-write</access>
		</field>
	  </fields>
	</register>
