nguyentri/da-pac/svd/DA14680.svd
	<registers>
	<register>
	<name>CHIP_ID1_REG</name>
	<description>Chip identification register 1.</description>
	<addressOffset>0x00000000</addressOffset>
	<size>8</size>
	<access>read-write</access>
	<resetValue>0x00000036</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields><field>
	<name>CHIP_ID1</name>
	<description>First character of device type &quot;680&quot; in ASCII. </description>
	<bitRange>[7:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>CHIP_ID2_REG</name>
	<description>Chip identification register 2.</description>
	<addressOffset>0x00000001</addressOffset>
	<size>8</size>
	<access>read-write</access>
	<resetValue>0x00000038</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields><field>
	<name>CHIP_ID2</name>
	<description>Second character of device type &quot;680&quot; in ASCII. </description>
	<bitRange>[7:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>CHIP_ID3_REG</name>
	<description>Chip identification register 3.</description>
	<addressOffset>0x00000002</addressOffset>
	<size>8</size>
	<access>read-write</access>
	<resetValue>0x00000030</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields><field>
	<name>CHIP_ID3</name>
	<description>Third character of device type &quot;680&quot; in ASCII. </description>
	<bitRange>[7:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>CHIP_REVISION_REG</name>
	<description>Chip revision register.</description>
	<addressOffset>0x00000004</addressOffset>
	<size>8</size>
	<access>read-write</access>
	<resetValue>0x00000042</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields><field>
	<name>REVISION_ID</name>
	<description>Chip version, corresponds with type number in ASCII.
0x41 = 'A', 0x42 = 'B' </description>
	<bitRange>[7:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>CHIP_SWC_REG</name>
	<description>Software compatibility register.</description>
	<addressOffset>0x00000003</addressOffset>
	<size>8</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields><field>
	<name>CHIP_SWC</name>
	<description>SoftWare Compatibility code.
Integer (default = 0) which is incremented if a silicon change has impact on the CPU Firmware.
Can be used by software developers to write silicon revision dependent code. </description>
	<bitRange>[3:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>COEX</name>
	<version>1.0</version>
	<description>COEX registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50002f00</baseAddress>
	<size>0</size>
	<addressBlock>
	<offset>0</offset>
	<size>52</size>
	<usage>registers</usage>
</addressBlock>
	
	<registers>
	<register>
	<name>COEX_BLE_PTI_REG</name>
	<description>COEX BLE PTI Control Register</description>
	<addressOffset>0x00000008</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>COEX_BLE_PTI</name>
	<description>This value specifies the PTI value that characterizes the next BLE transaction that will be initiated on the following &quot;ble_active&quot; positive edge. The value should remain constant during the high period of the &quot;ble_active&quot; signal.</description>
	<bitRange>[2:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>COEX_CTRL_REG</name>
	<description>COEX Control Register</description>
	<addressOffset>0x00000000</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>IGNORE_BLE</name>
	<description>If set to &quot;1&quot; then all BLE requests are ignored by masking the internal &quot;ble_active&quot; signal. Refer also to IGNORE_BLE_STAT.</description>
	<bitRange>[15:15]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>IGNORE_FTDF</name>
	<description>If set to &quot;1&quot; then all FTDF requests are ignored by masking the internal &quot;ftdf_active&quot; signal. Refer also to IGNORE_FTDF_STAT.</description>
	<bitRange>[14:14]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>IGNORE_EXT</name>
	<description>If set to &quot;1&quot; then all EXT requests are ignored by masking the internal &quot;ext_act&quot; signal (&quot;ext_act&quot; is the logical OR of &quot;ext_act0&quot; and &quot;ext_act1&quot;). Refer also to IGNORE_EXT_STAT.</description>
	<bitRange>[13:13]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>SEL_BLE_RADIO_BUSY</name>
	<description>Select the logic driving the BLE core input &quot;ble.radio_busy&quot;:
0: (decision==BLE) AND rfcu.radio_busy.
1: Hold to &quot;0&quot;.
2: (decision==FTDF) OR (decision==EXT) OR rfcu.radio_busy.
3: (decision==FTDF) OR (decision==EXT).
Selection &quot;0&quot; is the default, while selection &quot;2&quot; is the recommended value if the BLE SW supports it.</description>
	<bitRange>[12:11]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>SEL_BLE_WLAN_TX_RX</name>
	<description>If set to &quot;1&quot; then the COEX block will drive the WLAN_TX and WLAN_RX inputs of the BLE core. Otherwise both BLE inputs will be forced to &quot;0&quot;.</description>
	<bitRange>[10:10]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>SEL_FTDF_PTI</name>
	<description>It controls the source of the FTDF PTI value that the COEX Arbiter will use.
If &quot;0&quot; then use the COEX_FTDF_PTI_REG.
If &quot;1&quot; then use the PTI value provided by the FTDF core.</description>
	<bitRange>[8:8]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>SEL_FTDF_CCA</name>
	<description>If set to &quot;1&quot; and the COEX decision is different than &quot;FTDF&quot;, then the CCA_STAT signal going to FTDF (generated from the radio) will be forced to &quot;1&quot;; otherwise the FTDF.CCA_STAT will be driven with the signal generated from the radio.
Recommended value for SEL_FTDF_CCA is &quot;1&quot;.</description>
	<bitRange>[7:7]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>SEL_COEX_DIAG</name>
	<description>The COEX block can provide internal diagnostic signals by overwriting the BLE diagnostic bus, which is forwarded to GPIO multiplexing. There is no need to program the BLE registers, but only this field and the GPIO PID fields. The encoding of this bitfield is:
0: Don't overwrite any BLE diagnostic signal.
1: Overwrite the BLE Diagnostic bits 2 down to 0:
P2[2]: &quot;closing&quot; sub-state
P2[1:0]:&quot;decision&quot; state
2: Overwrite the BLE Diagnostic bits 5 down to 3:
P1[2]: &quot;closing&quot; sub-state
P1[1:0]:&quot;decision&quot; state
3: Reserved..</description>
	<bitRange>[6:5]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>SMART_ACT_IMPL</name>
	<description>Controls the behavior of the SMART_ACT (and SMART_PRI as a consequence).
If SMART_ACT_IMPL=&quot;0&quot; then if any BLE or FTDF MAC request is active then SMART_ACT will be asserted. SMART_ACT will actually be the logical OR of &quot;ble_active&quot; and &quot;ftdf_active&quot; internal signals. SMART_ACT will be asserted regardless the decision of the Arbiter to allow or disallow the access to the on-chip radio from the active MAC(s).
if SMART_ACT_IMPL=&quot;1&quot; then if the Arbiter's decision is to allow EXTernal MAC, then keep SMART_ACT to &quot;0&quot;, otherwise follow the implementation of SMART_ACT_IMPL=&quot;0&quot;.</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>PRGING_ARBITER</name>
	<description>If set to &quot;1&quot; then the current BLE transaction will complete normally and after that no further decision will be taken by the arbiter. The SW must keep this bit to &quot;1&quot; as long as it performs write operations on the COEX_PRI*_REG registers. As soon as the update on the priority registers will be completed, the SW should clear this bit.
Note: This bit is updated with the COEX_CLK, so depending on the relationship between the PCLK and COEX_CLK periods a write operation to this bit may be effective in more than one PCLK clock cycles, e.g. when the COEX_CLK rate is slower than the PCLK.</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>COEX_DIAG_REG</name>
	<description>COEX Diagnostic Monitor Register</description>
	<addressOffset>0x0000000c</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>COEX_DIAG_MON</name>
	<description>provides the current value of the diagnostic bus forwarded to the GPIO multiplexing (named PPA). Refer to the Pxy_MODE_REG[PID] value BLE_DIAG.</description>
	<bitRange>[15:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>COEX_FTDF_PTI_REG</name>
	<description>COEX FTDF PTI Control Register</description>
	<addressOffset>0x0000000a</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>COEX_FTDF_PTI</name>
	<description>This value specifies the PTI value that characterizes the next FTDF transaction that will be initiated on the following &quot;ftdf_active&quot; positive edge. The value should remain constant during the high period of the &quot;ftdf_active&quot; signal. Refer also to bitfield COEX_CTRL_REG.SEL_FTDF_PTI.</description>
	<bitRange>[2:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>COEX_INT_MASK_REG</name>
	<description>COEX Interrupt Mask Register</description>
	<addressOffset>0x00000004</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>COEX_IRQ_ON_DECISION_SW</name>
	<description>If &quot;1&quot; then a &quot;1&quot; on COEX_INT_STAT_REG[COEX_IRQ_ON_DECISION_SW] will cause COEX_IRQ_STAT to be set also to &quot;1&quot;.</description>
	<bitRange>[15:15]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>COEX_IRQ_ON_START_MID</name>
	<description>If &quot;1&quot; then a &quot;1&quot; on COEX_INT_STAT_REG[COEX_IRQ_ON_START_MID] will cause COEX_IRQ_STAT to be set also to &quot;1&quot;.</description>
	<bitRange>[14:14]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>COEX_IRQ_ON_CLOSING_BRK</name>
	<description>If &quot;1&quot; then a &quot;1&quot; on COEX_INT_STAT_REG[COEX_IRQ_ON_CLOSING_BRK] will cause COEX_IRQ_STAT to be set also to &quot;1&quot;.</description>
	<bitRange>[13:13]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>COEX_IRQ_ON_RADIO_BUSY_F</name>
	<description>If &quot;1&quot; then a &quot;1&quot; on COEX_INT_STAT_REG[COEX_IRQ_ON_RADIO_BUSY_F] will cause COEX_IRQ_STAT to be set also to &quot;1&quot;.</description>
	<bitRange>[12:12]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>COEX_IRQ_ON_RADIO_BUSY_R</name>
	<description>If &quot;1&quot; then a &quot;1&quot; on COEX_INT_STAT_REG[COEX_IRQ_ON_RADIO_BUSY_R] will cause COEX_IRQ_STAT to be set also to &quot;1&quot;.</description>
	<bitRange>[11:11]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>COEX_IRQ_ON_BLE_ACTIVE_F</name>
	<description>If &quot;1&quot; then a &quot;1&quot; on COEX_INT_STAT_REG[COEX_IRQ_ON_BLE_ACTIVE_F] will cause COEX_IRQ_STAT to be set also to &quot;1&quot;.</description>
	<bitRange>[10:10]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>COEX_IRQ_ON_BLE_ACTIVE_R</name>
	<description>If &quot;1&quot; then a &quot;1&quot; on COEX_INT_STAT_REG[COEX_IRQ_ON_BLE_ACTIVE_R] will cause COEX_IRQ_STAT to be set also to &quot;1&quot;.</description>
	<bitRange>[9:9]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>COEX_IRQ_ON_FTDF_ACTIVE_F</name>
	<description>If &quot;1&quot; then a &quot;1&quot; on COEX_INT_STAT_REG[COEX_IRQ_ON_FTDF_ACTIVE_F] will cause COEX_IRQ_STAT to be set also to &quot;1&quot;.</description>
	<bitRange>[8:8]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>COEX_IRQ_ON_FTDF_ACTIVE_R</name>
	<description>If &quot;1&quot; then a &quot;1&quot; on COEX_INT_STAT_REG[COEX_IRQ_ON_FTDF_ACTIVE_R] will cause COEX_IRQ_STAT to be set also to &quot;1&quot;.</description>
	<bitRange>[7:7]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>COEX_IRQ_ON_EXT_ACT_F</name>
	<description>If &quot;1&quot; then a &quot;1&quot; on COEX_INT_STAT_REG[COEX_IRQ_ON_EXT_ACT_F] will cause COEX_IRQ_STAT to be set also to &quot;1&quot;.</description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>COEX_IRQ_ON_EXT_ACT_R</name>
	<description>If &quot;1&quot; then a &quot;1&quot; on COEX_INT_STAT_REG[COEX_IRQ_ON_EXT_ACT_R] will cause COEX_IRQ_STAT to be set also to &quot;1&quot;.</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>COEX_IRQ_ON_SMART_PRI_F</name>
	<description>If &quot;1&quot; then a &quot;1&quot; on COEX_INT_STAT_REG[COEX_IRQ_ON_SMART_PRI_F] will cause COEX_IRQ_STAT to be set also to &quot;1&quot;.</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>COEX_IRQ_ON_SMART_PRI_R</name>
	<description>If &quot;1&quot; then a &quot;1&quot; on COEX_INT_STAT_REG[COEX_IRQ_ON_SMART_PRI_R] will cause COEX_IRQ_STAT to be set also to &quot;1&quot;.</description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>COEX_IRQ_ON_SMART_ACT_F</name>
	<description>If &quot;1&quot; then a &quot;1&quot; on COEX_INT_STAT_REG[COEX_IRQ_ON_SMART_ACT_F] will cause COEX_IRQ_STAT to be set also to &quot;1&quot;.</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>COEX_IRQ_ON_SMART_ACT_R</name>
	<description>If &quot;1&quot; then a &quot;1&quot; on COEX_INT_STAT_REG[COEX_IRQ_ON_SMART_ACT_R] will cause COEX_IRQ_STAT to be set also to &quot;1&quot;.</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>COEX_IRQ_MASK</name>
	<description>If set to &quot;1&quot; then sent an COEX_IRQ event to CPU as long as COEX_INT_STAT_REG[COEX_IRQ_STAT] is &quot;1&quot;.
If cleared then don't sent any IRQ event to CPU.</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>COEX_INT_STAT_REG</name>
	<description>COEX Interrupt Status Register</description>
	<addressOffset>0x00000006</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>COEX_IRQ_ON_DECISION_SW</name>
	<description>IRQ event when the decision switches to a new MAC. It ignores the intermediate transitions to DECISION==NONE.
Note that after a Radio domain reset, the first transition of the decision to any MAC will also trigger this event.</description>
	<bitRange>[15:15]</bitRange>
	<access>read-only</access>
	</field>
	<field>
	<name>COEX_IRQ_ON_START_MID</name>
	<description>IRQ event when the decision switches to a MAC, while the TX_EN or RX_EN of this MAC are high. This event signals a potential break of a transmission or reception.</description>
	<bitRange>[14:14]</bitRange>
	<access>read-only</access>
	</field>
	<field>
	<name>COEX_IRQ_ON_CLOSING_BRK</name>
	<description>IRQ if while entering into &quot;closing&quot; sub-state, the TX_EN or RX_EN are active. This event signals a potential break of a transmission or reception.</description>
	<bitRange>[13:13]</bitRange>
	<access>read-only</access>
	</field>
	<field>
	<name>COEX_IRQ_ON_RADIO_BUSY_F</name>
	<description>IRQ event on falling edge of RADIO_BUSY. </description>
	<bitRange>[12:12]</bitRange>
	<access>read-only</access>
	</field>
	<field>
	<name>COEX_IRQ_ON_RADIO_BUSY_R</name>
	<description>IRQ event on rising edge of RADIO_BUSY. </description>
	<bitRange>[11:11]</bitRange>
	<access>read-only</access>
	</field>
	<field>
	<name>COEX_IRQ_ON_BLE_ACTIVE_F</name>
	<description>IRQ event on falling edge of BLE_ACTIVE internal signal.</description>
	<bitRange>[10:10]</bitRange>
	<access>read-only</access>
	</field>
	<field>
	<name>COEX_IRQ_ON_BLE_ACTIVE_R</name>
	<description>IRQ event on rising edge of BLE_ACTIVE internal signal.</description>
	<bitRange>[9:9]</bitRange>
	<access>read-only</access>
	</field>
	<field>
	<name>COEX_IRQ_ON_FTDF_ACTIVE_F</name>
	<description>IRQ event on falling edge of FTDF_ACTIVE internal signal. </description>
	<bitRange>[8:8]</bitRange>
	<access>read-only</access>
	</field>
	<field>
	<name>COEX_IRQ_ON_FTDF_ACTIVE_R</name>
	<description>IRQ event on rising edge of FTDF_ACTIVE internal signal. </description>
	<bitRange>[7:7]</bitRange>
	<access>read-only</access>
	</field>
	<field>
	<name>COEX_IRQ_ON_EXT_ACT_F</name>
	<description>RQ event on falling edge of EXT_ACT. </description>
	<bitRange>[6:6]</bitRange>
	<access>read-only</access>
	</field>
	<field>
	<name>COEX_IRQ_ON_EXT_ACT_R</name>
	<description>IRQ event on rising edge of EXT_ACT. </description>
	<bitRange>[5:5]</bitRange>
	<access>read-only</access>
	</field>
	<field>
	<name>COEX_IRQ_ON_SMART_PRI_F</name>
	<description>IRQ event on falling edge of SMART_PRI. </description>
	<bitRange>[4:4]</bitRange>
	<access>read-only</access>
	</field>
	<field>
	<name>COEX_IRQ_ON_SMART_PRI_R</name>
	<description>IRQ event on rising edge of SMART_PRI. </description>
	<bitRange>[3:3]</bitRange>
	<access>read-only</access>
	</field>
	<field>
	<name>COEX_IRQ_ON_SMART_ACT_F</name>
	<description>IRQ event on falling edge of SMART_ACT. </description>
	<bitRange>[2:2]</bitRange>
	<access>read-only</access>
	</field>
	<field>
	<name>COEX_IRQ_ON_SMART_ACT_R</name>
	<description>IRQ event on rising edge of SMART_ACT. </description>
	<bitRange>[1:1]</bitRange>
	<access>read-only</access>
	</field>
	<field>
	<name>COEX_IRQ_STAT</name>
	<description>For each COEX_IRQ_ON_* bitfield of COEX_INT_STAT_REG the corresponding mask is applied and afterwards all the intermediate results are combined with a logical OR in order to produce the COEX_IRQ_STAT bitfield. If furthermore the COEX_INT_MASK_REG[COEX_IRQ_MASK] is set to &quot;1&quot;, then a COEX_IRQ signal will be forwarded to the CPU.

