nguyentri/da-pac/svd/DA14680.svd
Note: Each COEX_IRQ_ON_* bitfield of COEX_INT_STAT_REG will be set to &quot;1&quot; on the detection of the corresponding event and will be cleared to &quot;0&quot; on the read of COEX_INT_STAT_REG. The automated clear may delay a couple of PCLK cycles, depending on the relationship between PCLK and COEX_CLK.</description>
	<bitRange>[0:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>COEX_PRI10_REG</name>
	<description>COEX Priority Register</description>
	<addressOffset>0x00000024</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>COEX_PRI_MAC</name>
	<description>Refer to COEX_PRI1_REG.</description>
	<bitRange>[4:3]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>COEX_PRI_PTI</name>
	<description>Refer to COEX_PRI1_REG.</description>
	<bitRange>[2:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>COEX_PRI11_REG</name>
	<description>COEX Priority Register</description>
	<addressOffset>0x00000026</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>COEX_PRI_MAC</name>
	<description>Refer to COEX_PRI1_REG.</description>
	<bitRange>[4:3]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>COEX_PRI_PTI</name>
	<description>Refer to COEX_PRI1_REG.</description>
	<bitRange>[2:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>COEX_PRI12_REG</name>
	<description>COEX Priority Register</description>
	<addressOffset>0x00000028</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>COEX_PRI_MAC</name>
	<description>Refer to COEX_PRI1_REG.</description>
	<bitRange>[4:3]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>COEX_PRI_PTI</name>
	<description>Refer to COEX_PRI1_REG.</description>
	<bitRange>[2:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>COEX_PRI13_REG</name>
	<description>COEX Priority Register</description>
	<addressOffset>0x0000002a</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>COEX_PRI_MAC</name>
	<description>Refer to COEX_PRI1_REG.</description>
	<bitRange>[4:3]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>COEX_PRI_PTI</name>
	<description>Refer to COEX_PRI1_REG.</description>
	<bitRange>[2:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>COEX_PRI14_REG</name>
	<description>COEX Priority Register</description>
	<addressOffset>0x0000002c</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>COEX_PRI_MAC</name>
	<description>Refer to COEX_PRI1_REG.</description>
	<bitRange>[4:3]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>COEX_PRI_PTI</name>
	<description>Refer to COEX_PRI1_REG.</description>
	<bitRange>[2:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>COEX_PRI15_REG</name>
	<description>COEX Priority Register</description>
	<addressOffset>0x0000002e</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>COEX_PRI_MAC</name>
	<description>Refer to COEX_PRI1_REG.</description>
	<bitRange>[4:3]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>COEX_PRI_PTI</name>
	<description>Refer to COEX_PRI1_REG.</description>
	<bitRange>[2:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>COEX_PRI16_REG</name>
	<description>COEX Priority Register</description>
	<addressOffset>0x00000030</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>COEX_PRI_MAC</name>
	<description>Refer to COEX_PRI1_REG.</description>
	<bitRange>[4:3]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>COEX_PRI_PTI</name>
	<description>Refer to COEX_PRI1_REG.</description>
	<bitRange>[2:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>COEX_PRI17_REG</name>
	<description>COEX Priority Register</description>
	<addressOffset>0x00000032</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>COEX_PRI_MAC</name>
	<description>Refer to COEX_PRI1_REG.</description>
	<bitRange>[4:3]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>COEX_PRI_PTI</name>
	<description>Refer to COEX_PRI1_REG.</description>
	<bitRange>[2:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>COEX_PRI1_REG</name>
	<description>COEX Priority Register</description>
	<addressOffset>0x00000012</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000018</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>COEX_PRI_MAC</name>
	<description>Specifies the MAC that has been assigned with the specific priority level. The MAC encoding follows the COEX_DECISION bitfield encoding.</description>
	<bitRange>[4:3]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>COEX_PRI_PTI</name>
	<description>The priority level specified by this register will be applied to the packets coming from the MAC specified by the COEX_PRI_MAC bitfield and characterized with the PTI value specified by the COEX_PRI_PTI bitfield. </description>
	<bitRange>[2:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>COEX_PRI2_REG</name>
	<description>COEX Priority Register</description>
	<addressOffset>0x00000014</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000008</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>COEX_PRI_MAC</name>
	<description>Refer to COEX_PRI1_REG.</description>
	<bitRange>[4:3]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>COEX_PRI_PTI</name>
	<description>Refer to COEX_PRI1_REG.</description>
	<bitRange>[2:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>COEX_PRI3_REG</name>
	<description>COEX Priority Register</description>
	<addressOffset>0x00000016</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000010</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>COEX_PRI_MAC</name>
	<description>Refer to COEX_PRI1_REG.</description>
	<bitRange>[4:3]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>COEX_PRI_PTI</name>
	<description>Refer to COEX_PRI1_REG.</description>
	<bitRange>[2:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>COEX_PRI4_REG</name>
	<description>COEX Priority Register</description>
	<addressOffset>0x00000018</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>COEX_PRI_MAC</name>
	<description>Refer to COEX_PRI1_REG.</description>
	<bitRange>[4:3]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>COEX_PRI_PTI</name>
	<description>Refer to COEX_PRI1_REG.</description>
	<bitRange>[2:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>COEX_PRI5_REG</name>
	<description>COEX Priority Register</description>
	<addressOffset>0x0000001a</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>COEX_PRI_MAC</name>
	<description>Refer to COEX_PRI1_REG.</description>
	<bitRange>[4:3]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>COEX_PRI_PTI</name>
	<description>Refer to COEX_PRI1_REG.</description>
	<bitRange>[2:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>COEX_PRI6_REG</name>
	<description>COEX Priority Register</description>
	<addressOffset>0x0000001c</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>COEX_PRI_MAC</name>
	<description>Refer to COEX_PRI1_REG.</description>
	<bitRange>[4:3]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>COEX_PRI_PTI</name>
	<description>Refer to COEX_PRI1_REG.</description>
	<bitRange>[2:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>COEX_PRI7_REG</name>
	<description>COEX Priority Register</description>
	<addressOffset>0x0000001e</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>COEX_PRI_MAC</name>
	<description>Refer to COEX_PRI1_REG.</description>
	<bitRange>[4:3]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>COEX_PRI_PTI</name>
	<description>Refer to COEX_PRI1_REG.</description>
	<bitRange>[2:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>COEX_PRI8_REG</name>
	<description>COEX Priority Register</description>
	<addressOffset>0x00000020</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>COEX_PRI_MAC</name>
	<description>Refer to COEX_PRI1_REG.</description>
	<bitRange>[4:3]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>COEX_PRI_PTI</name>
	<description>Refer to COEX_PRI1_REG.</description>
	<bitRange>[2:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>COEX_PRI9_REG</name>
	<description>COEX Priority Register</description>
	<addressOffset>0x00000022</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>COEX_PRI_MAC</name>
	<description>Refer to COEX_PRI1_REG.</description>
	<bitRange>[4:3]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>COEX_PRI_PTI</name>
	<description>Refer to COEX_PRI1_REG.</description>
	<bitRange>[2:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>COEX_STAT_REG</name>
	<description>COEX Status Register</description>
	<addressOffset>0x00000002</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>IGNORE_BLE_STAT</name>
	<description>This signal is constantly &quot;1&quot; on FTDF-only chips.
If set to &quot;1&quot; then all BLE requests are ignored by masking immediately the request signal from the BLE.
In more detail, the internal signal &quot;ble_active&quot; is the logical AND of this bitfield and the &quot;ble.event_in_process&quot;.</description>
	<bitRange>[15:15]</bitRange>
	<access>read-only</access>
	</field>
	<field>
	<name>IGNORE_FTDF_STAT</name>
	<description>This signal is constantly &quot;1&quot; on BLE-only chips.
If set to &quot;1&quot; then all FTDF requests are ignored by masking immediately the request signal from the FTDF.
In more detail, the internal signal &quot;ftdf_active&quot; is the logical AND of this bitfield and the &quot;ftdf.phy_en&quot;.</description>
	<bitRange>[14:14]</bitRange>
	<access>read-only</access>
	</field>
	<field>
	<name>IGNORE_EXT_STAT</name>
	<description>If set to &quot;1&quot; then all EXT requests are ignored by masking immediately the request signal from the external MAC.
In more detail, the internal signal &quot;ext_active&quot; is the logical AND of this bitfield and the &quot;ext_act&quot;.</description>
	<bitRange>[13:13]</bitRange>
	<access>read-only</access>
	</field>
	<field>
	<name>COEX_RADIO_BUSY</name>
	<description>Current state of RADIO_BUSY signal generated from RFCU, which is the logical OR among all Radio DCFs.
Note that the arbiter will process this value with one COEX clock cycle delay.</description>
	<bitRange>[12:12]</bitRange>
	<access>read-only</access>
	</field>
	<field>
	<name>EXT_ACT1</name>
	<description>Current state of the pin.</description>
	<bitRange>[11:11]</bitRange>
	<access>read-only</access>
	</field>
	<field>
	<name>EXT_ACT0</name>
	<description>Current state of the pin.</description>
	<bitRange>[10:10]</bitRange>
	<access>read-only</access>
	</field>
	<field>
	<name>SMART_PRI</name>
	<description>Current state of the pin.</description>
	<bitRange>[9:9]</bitRange>
	<access>read-only</access>
	</field>
	<field>
	<name>SMART_ACT</name>
	<description>Current state of the pin.</description>
	<bitRange>[8:8]</bitRange>
	<access>read-only</access>
	</field>
	<field>
	<name>COEX_DECISION_CLOSING</name>
	<description>Provides the value of the &quot;CLOSING&quot; substate.</description>
	<bitRange>[7:7]</bitRange>
	<access>read-only</access>
	</field>
	<field>
	<name>COEX_DECISION</name>
	<description>Decision values:
0: Decision is NONE.
1: Decision is BLE.
2: Decision is FTDF.
3: Decision is EXT.
Note: If &quot;0&quot; (i.e. decision is NONE) then no MAC will have access to the on-chip radio. As a consequence, the SMART_PRI signal will stay low, since no on-chip (SMART) MAC will have priority.
Note: The decision NONE will be held as long as there is no &quot;*_active&quot; internal signal from BLE, FTDF or EXT. Also, if in programming state and the last transaction has been finished, then the decision will be held also to NONE.
Note: While in programming mode, the COEX_PRIx_REGs are considered as invalid, which means that no new decision can be taken.</description>
	<bitRange>[6:5]</bitRange>
	<access>read-only</access>
	</field>
	<field>
	<name>COEX_DECISION_PTR</name>
	<description>Provides the number &quot;x&quot; of the COEX_PRIx_REG that win the last arbitration cycle. If &quot;0&quot; then it is a null pointer, pointing to no COEX_PRIx_REG.</description>
	<bitRange>[4:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>CRG_PER</name>
	<version>1.0</version>
	<description>CRG_PER registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50001c00</baseAddress>
	<size>0</size>
	<addressBlock>
	<offset>0</offset>
	<size>76</size>
	<usage>registers</usage>
</addressBlock>
	
