nguyentri/da-pac/svd/DA14680.svd
# $software_scratch@retention_ram
# TX ram not used by hardware, can be used by software as scratch ram with retention. </description>
	<bitRange>[15:8]</bitRange>
	<access>read-only</access>
	</field>
	<field>
	<name>ISPANID_COORD_ERROR</name>
	<description>Received frame not for PAN coordinator, applicable when frame is not discarded </description>
	<bitRange>[7:7]</bitRange>
	<access>read-only</access>
	</field>
	<field>
	<name>SPANID_ERROR</name>
	<description>PAN ID error, applicable when frame is not discarded </description>
	<bitRange>[6:6]</bitRange>
	<access>read-only</access>
	</field>
	<field>
	<name>DADDR_ERROR</name>
	<description>D Address error, applicable when frame is not discarded </description>
	<bitRange>[5:5]</bitRange>
	<access>read-only</access>
	</field>
	<field>
	<name>DPANID_ERROR</name>
	<description>D PAN ID error, applicable when frame is not discarded </description>
	<bitRange>[4:4]</bitRange>
	<access>read-only</access>
	</field>
	<field>
	<name>RES_FRM_VERSION_ERROR</name>
	<description>Not supported frame version error, applicable when frame is not discarded. </description>
	<bitRange>[3:3]</bitRange>
	<access>read-only</access>
	</field>
	<field>
	<name>RES_FRM_TYPE_ERROR</name>
	<description>Not supported frame type error, applicable when frame is not discarded </description>
	<bitRange>[2:2]</bitRange>
	<access>read-only</access>
	</field>
	<field>
	<name>CRC16_ERROR</name>
	<description>CRC error, applicable for transparent mode only </description>
	<bitRange>[0:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>FTDF_RX_META_1_2_REG</name>
	<description>Receive metadata register 2</description>
	<addressOffset>0x000002a4</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000fffd</resetMask>
	<fields><field>
	<name>QUALITY_INDICATOR</name>
	<description>Link Quality Indication

# $software_scratch@retention_ram
# TX ram not used by hardware, can be used by software as scratch ram with retention. </description>
	<bitRange>[15:8]</bitRange>
	<access>read-only</access>
	</field>
	<field>
	<name>ISPANID_COORD_ERROR</name>
	<description>Received frame not for PAN coordinator, applicable when frame is not discarded </description>
	<bitRange>[7:7]</bitRange>
	<access>read-only</access>
	</field>
	<field>
	<name>SPANID_ERROR</name>
	<description>PAN ID error, applicable when frame is not discarded </description>
	<bitRange>[6:6]</bitRange>
	<access>read-only</access>
	</field>
	<field>
	<name>DADDR_ERROR</name>
	<description>D Address error, applicable when frame is not discarded </description>
	<bitRange>[5:5]</bitRange>
	<access>read-only</access>
	</field>
	<field>
	<name>DPANID_ERROR</name>
	<description>D PAN ID error, applicable when frame is not discarded </description>
	<bitRange>[4:4]</bitRange>
	<access>read-only</access>
	</field>
	<field>
	<name>RES_FRM_VERSION_ERROR</name>
	<description>Not supported frame version error, applicable when frame is not discarded. </description>
	<bitRange>[3:3]</bitRange>
	<access>read-only</access>
	</field>
	<field>
	<name>RES_FRM_TYPE_ERROR</name>
	<description>Not supported frame type error, applicable when frame is not discarded </description>
	<bitRange>[2:2]</bitRange>
	<access>read-only</access>
	</field>
	<field>
	<name>CRC16_ERROR</name>
	<description>CRC error, applicable for transparent mode only </description>
	<bitRange>[0:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>FTDF_RX_META_1_3_REG</name>
	<description>Receive metadata register 3</description>
	<addressOffset>0x000002b4</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000fffd</resetMask>
	<fields><field>
	<name>QUALITY_INDICATOR</name>
	<description>Link Quality Indication

# $software_scratch@retention_ram
# TX ram not used by hardware, can be used by software as scratch ram with retention. </description>
	<bitRange>[15:8]</bitRange>
	<access>read-only</access>
	</field>
	<field>
	<name>ISPANID_COORD_ERROR</name>
	<description>Received frame not for PAN coordinator, applicable when frame is not discarded </description>
	<bitRange>[7:7]</bitRange>
	<access>read-only</access>
	</field>
	<field>
	<name>SPANID_ERROR</name>
	<description>PAN ID error, applicable when frame is not discarded </description>
	<bitRange>[6:6]</bitRange>
	<access>read-only</access>
	</field>
	<field>
	<name>DADDR_ERROR</name>
	<description>D Address error, applicable when frame is not discarded </description>
	<bitRange>[5:5]</bitRange>
	<access>read-only</access>
	</field>
	<field>
	<name>DPANID_ERROR</name>
	<description>D PAN ID error, applicable when frame is not discarded </description>
	<bitRange>[4:4]</bitRange>
	<access>read-only</access>
	</field>
	<field>
	<name>RES_FRM_VERSION_ERROR</name>
	<description>Not supported frame version error, applicable when frame is not discarded. </description>
	<bitRange>[3:3]</bitRange>
	<access>read-only</access>
	</field>
	<field>
	<name>RES_FRM_TYPE_ERROR</name>
	<description>Not supported frame type error, applicable when frame is not discarded </description>
	<bitRange>[2:2]</bitRange>
	<access>read-only</access>
	</field>
	<field>
	<name>CRC16_ERROR</name>
	<description>CRC error, applicable for transparent mode only </description>
	<bitRange>[0:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>FTDF_RX_META_1_4_REG</name>
	<description>Receive metadata register 4</description>
	<addressOffset>0x000002c4</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000fffd</resetMask>
	<fields><field>
	<name>QUALITY_INDICATOR</name>
	<description>Link Quality Indication

# $software_scratch@retention_ram
# TX ram not used by hardware, can be used by software as scratch ram with retention. </description>
	<bitRange>[15:8]</bitRange>
	<access>read-only</access>
	</field>
	<field>
	<name>ISPANID_COORD_ERROR</name>
	<description>Received frame not for PAN coordinator, applicable when frame is not discarded </description>
	<bitRange>[7:7]</bitRange>
	<access>read-only</access>
	</field>
	<field>
	<name>SPANID_ERROR</name>
	<description>PAN ID error, applicable when frame is not discarded </description>
	<bitRange>[6:6]</bitRange>
	<access>read-only</access>
	</field>
	<field>
	<name>DADDR_ERROR</name>
	<description>D Address error, applicable when frame is not discarded </description>
	<bitRange>[5:5]</bitRange>
	<access>read-only</access>
	</field>
	<field>
	<name>DPANID_ERROR</name>
	<description>D PAN ID error, applicable when frame is not discarded </description>
	<bitRange>[4:4]</bitRange>
	<access>read-only</access>
	</field>
	<field>
	<name>RES_FRM_VERSION_ERROR</name>
	<description>Not supported frame version error, applicable when frame is not discarded. </description>
	<bitRange>[3:3]</bitRange>
	<access>read-only</access>
	</field>
	<field>
	<name>RES_FRM_TYPE_ERROR</name>
	<description>Not supported frame type error, applicable when frame is not discarded </description>
	<bitRange>[2:2]</bitRange>
	<access>read-only</access>
	</field>
	<field>
	<name>CRC16_ERROR</name>
	<description>CRC error, applicable for transparent mode only </description>
	<bitRange>[0:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>FTDF_RX_META_1_5_REG</name>
	<description>Receive metadata register 5</description>
	<addressOffset>0x000002d4</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000fffd</resetMask>
	<fields><field>
	<name>QUALITY_INDICATOR</name>
	<description>Link Quality Indication

# $software_scratch@retention_ram
# TX ram not used by hardware, can be used by software as scratch ram with retention. </description>
	<bitRange>[15:8]</bitRange>
	<access>read-only</access>
	</field>
	<field>
	<name>ISPANID_COORD_ERROR</name>
	<description>Received frame not for PAN coordinator, applicable when frame is not discarded </description>
	<bitRange>[7:7]</bitRange>
	<access>read-only</access>
	</field>
	<field>
	<name>SPANID_ERROR</name>
	<description>PAN ID error, applicable when frame is not discarded </description>
	<bitRange>[6:6]</bitRange>
	<access>read-only</access>
	</field>
	<field>
	<name>DADDR_ERROR</name>
	<description>D Address error, applicable when frame is not discarded </description>
	<bitRange>[5:5]</bitRange>
	<access>read-only</access>
	</field>
	<field>
	<name>DPANID_ERROR</name>
	<description>D PAN ID error, applicable when frame is not discarded </description>
	<bitRange>[4:4]</bitRange>
	<access>read-only</access>
	</field>
	<field>
	<name>RES_FRM_VERSION_ERROR</name>
	<description>Not supported frame version error, applicable when frame is not discarded. </description>
	<bitRange>[3:3]</bitRange>
	<access>read-only</access>
	</field>
	<field>
	<name>RES_FRM_TYPE_ERROR</name>
	<description>Not supported frame type error, applicable when frame is not discarded </description>
	<bitRange>[2:2]</bitRange>
	<access>read-only</access>
	</field>
	<field>
	<name>CRC16_ERROR</name>
	<description>CRC error, applicable for transparent mode only </description>
	<bitRange>[0:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>FTDF_RX_META_1_6_REG</name>
	<description>Receive metadata register 6</description>
	<addressOffset>0x000002e4</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000fffd</resetMask>
	<fields><field>
	<name>QUALITY_INDICATOR</name>
	<description>Link Quality Indication

# $software_scratch@retention_ram
# TX ram not used by hardware, can be used by software as scratch ram with retention. </description>
	<bitRange>[15:8]</bitRange>
	<access>read-only</access>
	</field>
	<field>
	<name>ISPANID_COORD_ERROR</name>
	<description>Received frame not for PAN coordinator, applicable when frame is not discarded </description>
	<bitRange>[7:7]</bitRange>
	<access>read-only</access>
	</field>
	<field>
	<name>SPANID_ERROR</name>
	<description>PAN ID error, applicable when frame is not discarded </description>
	<bitRange>[6:6]</bitRange>
	<access>read-only</access>
	</field>
	<field>
	<name>DADDR_ERROR</name>
	<description>D Address error, applicable when frame is not discarded </description>
	<bitRange>[5:5]</bitRange>
	<access>read-only</access>
	</field>
	<field>
	<name>DPANID_ERROR</name>
	<description>D PAN ID error, applicable when frame is not discarded </description>
	<bitRange>[4:4]</bitRange>
	<access>read-only</access>
	</field>
	<field>
	<name>RES_FRM_VERSION_ERROR</name>
	<description>Not supported frame version error, applicable when frame is not discarded. </description>
	<bitRange>[3:3]</bitRange>
	<access>read-only</access>
	</field>
	<field>
	<name>RES_FRM_TYPE_ERROR</name>
	<description>Not supported frame type error, applicable when frame is not discarded </description>
	<bitRange>[2:2]</bitRange>
	<access>read-only</access>
	</field>
	<field>
	<name>CRC16_ERROR</name>
	<description>CRC error, applicable for transparent mode only </description>
	<bitRange>[0:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>FTDF_RX_META_1_7_REG</name>
	<description>Receive metadata register 7</description>
	<addressOffset>0x000002f4</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000fffd</resetMask>
	<fields><field>
	<name>QUALITY_INDICATOR</name>
	<description>Link Quality Indication

