nguyentri/da-pac/svd/DA14680.svd
	</field></fields>
</register><register>
	<name>P2_DATA_REG</name>
	<description>P2 Data input / output Register</description>
	<addressOffset>0x00000004</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>P2_DATA</name>
	<description>Set P2 output register when written; Returns the value of P2 port when read </description>
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>P2_PADPWR_CTRL_REG</name>
	<description>P2 Output Power Control Register</description>
	<addressOffset>0x000000c4</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>P2_OUT_CTRL</name>
	<description>1 = P2_x port output is powered by VDD1V8P rail
0 = P2_x port output is powered by V33 rail
bit x controls the power supply of P2[x]</description>
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>P2_RESET_DATA_REG</name>
	<description>P2 Reset port pins Register</description>
	<addressOffset>0x00000018</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>P2_RESET</name>
	<description>Writing a 1 to P2[y] sets P2[y] to 0. Writing 0 is discarded;
Reading returns 0 </description>
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>P2_SET_DATA_REG</name>
	<description>P2 Set port pins Register</description>
	<addressOffset>0x0000000e</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>P2_SET</name>
	<description>Writing a 1 to P2[y] sets P2[y] to 1. Writing 0 is discarded;
Reading returns 0 </description>
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>P30_MODE_REG</name>
	<description>P30 Mode Register</description>
	<addressOffset>0x0000004e</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000200</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>PPOD</name>
	<description>0: Push pull
1: Open drain</description>
	<bitRange>[10:10]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>PUPD</name>
	<description>00 = Input, no resistors selected
01 = Input, pull-up selected
10 = Input, pull-down selected
11 = Output, no resistors selected
In ADC mode, these bits are don't care </description>
	<bitRange>[9:8]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>PID</name>
	<description>See P00_MODE_REG[PID] </description>
	<bitRange>[5:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>P31_MODE_REG</name>
	<description>P31 Mode Register</description>
	<addressOffset>0x00000050</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000200</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>PPOD</name>
	<description>0: Push pull
1: Open drain</description>
	<bitRange>[10:10]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>PUPD</name>
	<description>00 = Input, no resistors selected
01 = Input, pull-up selected
10 = Input, pull-down selected
11 = Output, no resistors selected
In ADC mode, these bits are don't care </description>
	<bitRange>[9:8]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>PID</name>
	<description>See P00_MODE_REG[PID] </description>
	<bitRange>[5:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>P32_MODE_REG</name>
	<description>P32 Mode Register</description>
	<addressOffset>0x00000052</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000200</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>PPOD</name>
	<description>0: Push pull
1: Open drain</description>
	<bitRange>[10:10]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>PUPD</name>
	<description>00 = Input, no resistors selected
01 = Input, pull-up selected
10 = Input, pull-down selected
11 = Output, no resistors selected
In ADC mode, these bits are don't care </description>
	<bitRange>[9:8]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>PID</name>
	<description>See P00_MODE_REG[PID] </description>
	<bitRange>[5:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>P33_MODE_REG</name>
	<description>P33 Mode Register</description>
	<addressOffset>0x00000054</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000200</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>PPOD</name>
	<description>0: Push pull
1: Open drain</description>
	<bitRange>[10:10]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>PUPD</name>
	<description>00 = Input, no resistors selected
01 = Input, pull-up selected
10 = Input, pull-down selected
11 = Output, no resistors selected
In ADC mode, these bits are don't care </description>
	<bitRange>[9:8]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>PID</name>
	<description>See P00_MODE_REG[PID] </description>
	<bitRange>[5:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>P34_MODE_REG</name>
	<description>P34 Mode Register</description>
	<addressOffset>0x00000056</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000200</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>PPOD</name>
	<description>0: Push pull
1: Open drain</description>
	<bitRange>[10:10]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>PUPD</name>
	<description>00 = Input, no resistors selected
01 = Input, pull-up selected
10 = Input, pull-down selected
11 = Output, no resistors selected
In ADC mode, these bits are don't care </description>
	<bitRange>[9:8]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>PID</name>
	<description>See P00_MODE_REG[PID] </description>
	<bitRange>[5:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>P35_MODE_REG</name>
	<description>P35 Mode Register</description>
	<addressOffset>0x00000058</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000200</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>PPOD</name>
	<description>0: Push pull
1: Open drain</description>
	<bitRange>[10:10]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>PUPD</name>
	<description>00 = Input, no resistors selected
01 = Input, pull-up selected
10 = Input, pull-down selected
11 = Output, no resistors selected
In ADC mode, these bits are don't care </description>
	<bitRange>[9:8]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>PID</name>
	<description>See P00_MODE_REG[PID] </description>
	<bitRange>[5:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>P36_MODE_REG</name>
	<description>P36 Mode Register</description>
	<addressOffset>0x0000005a</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000200</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>PPOD</name>
	<description>0: Push pull
1: Open drain</description>
	<bitRange>[10:10]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>PUPD</name>
	<description>00 = Input, no resistors selected
01 = Input, pull-up selected
10 = Input, pull-down selected
11 = Output, no resistors selected
In ADC mode, these bits are don't care </description>
	<bitRange>[9:8]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>PID</name>
	<description>See P00_MODE_REG[PID] </description>
	<bitRange>[5:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>P37_MODE_REG</name>
	<description>P37 Mode Register</description>
	<addressOffset>0x0000005c</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000200</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>PPOD</name>
	<description>0: Push pull
1: Open drain</description>
	<bitRange>[10:10]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>PUPD</name>
	<description>00 = Input, no resistors selected
01 = Input, pull-up selected
10 = Input, pull-down selected
11 = Output, no resistors selected
In ADC mode, these bits are don't care </description>
	<bitRange>[9:8]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>PID</name>
	<description>See P00_MODE_REG[PID] </description>
	<bitRange>[5:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>P3_DATA_REG</name>
	<description>P3 Data input / output Register</description>
	<addressOffset>0x00000006</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>P3_DATA</name>
	<description>Set P3 output register when written; Returns the value of P3 port when read </description>
	<bitRange>[7:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>P3_PADPWR_CTRL_REG</name>
	<description>P3 Output Power Control Register</description>
	<addressOffset>0x000000c6</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>P3_OUT_CTRL</name>
	<description>1 = P3_x port output is powered by VDD1V8P rail
0 = P3_x port output is powered by V33 rail
bit x controls the power supply of P3[x]</description>
	<bitRange>[7:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>P3_RESET_DATA_REG</name>
	<description>P3 Reset port pins Register</description>
	<addressOffset>0x0000001a</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>P3_RESET</name>
	<description>Writing a 1 to P3[y] sets P3[y] to 0. Writing 0 is discarded;
Reading returns 0</description>
	<bitRange>[7:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>P3_SET_DATA_REG</name>
	<description>P3 Set port pins Register</description>
	<addressOffset>0x00000010</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>P3_SET</name>
	<description>Writing a 1 to P3[y] sets P3[y] to 1. Writing 0 is discarded; Reading returns 0</description>
	<bitRange>[7:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>P40_MODE_REG</name>
	<description>P40 Mode Register</description>
	<addressOffset>0x0000005e</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000200</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>PPOD</name>
	<description>0: Push pull
1: Open drain</description>
	<bitRange>[10:10]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>PUPD</name>
	<description>00 = Input, no resistors selected
01 = Input, pull-up selected
10 = Input, pull-down selected
11 = Output, no resistors selected
In ADC mode, these bits are don't care </description>
	<bitRange>[9:8]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>PID</name>
	<description>See P00_MODE_REG[PID] </description>
	<bitRange>[5:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>P41_MODE_REG</name>
	<description>P41 Mode Register</description>
	<addressOffset>0x00000060</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000200</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>PPOD</name>
	<description>0: Push pull
1: Open drain</description>
	<bitRange>[10:10]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>PUPD</name>
	<description>00 = Input, no resistors selected
01 = Input, pull-up selected
10 = Input, pull-down selected
11 = Output, no resistors selected
In ADC mode, these bits are don't care </description>
	<bitRange>[9:8]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>PID</name>
	<description>See P00_MODE_REG[PID] </description>
	<bitRange>[5:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>P42_MODE_REG</name>
	<description>P42 Mode Register</description>
	<addressOffset>0x00000062</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000200</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>PPOD</name>
	<description>0: Push pull
1: Open drain</description>
	<bitRange>[10:10]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>PUPD</name>
	<description>00 = Input, no resistors selected
01 = Input, pull-up selected
10 = Input, pull-down selected
11 = Output, no resistors selected
In ADC mode, these bits are don't care </description>
	<bitRange>[9:8]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>PID</name>
	<description>See P00_MODE_REG[PID] </description>
	<bitRange>[5:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>P43_MODE_REG</name>
	<description>P43 Mode Register</description>
	<addressOffset>0x00000064</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000200</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>PPOD</name>
	<description>0: Push pull
1: Open drain</description>
	<bitRange>[10:10]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>PUPD</name>
	<description>00 = Input, no resistors selected
01 = Input, pull-up selected
10 = Input, pull-down selected
11 = Output, no resistors selected
In ADC mode, these bits are don't care </description>
	<bitRange>[9:8]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>PID</name>
	<description>See P00_MODE_REG[PID] </description>
	<bitRange>[5:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>P44_MODE_REG</name>
	<description>P44 Mode Register</description>
	<addressOffset>0x00000066</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000200</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>PPOD</name>
	<description>0: Push pull
1: Open drain</description>
	<bitRange>[10:10]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>PUPD</name>
	<description>00 = Input, no resistors selected
01 = Input, pull-up selected
10 = Input, pull-down selected
11 = Output, no resistors selected
In ADC mode, these bits are don't care </description>
	<bitRange>[9:8]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>PID</name>
	<description>See P00_MODE_REG[PID] </description>
	<bitRange>[5:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>P45_MODE_REG</name>
	<description>P45 Mode Register</description>
	<addressOffset>0x00000068</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000200</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>PPOD</name>
	<description>0: Push pull
1: Open drain</description>
	<bitRange>[10:10]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>PUPD</name>
	<description>00 = Input, no resistors selected
01 = Input, pull-up selected
10 = Input, pull-down selected
11 = Output, no resistors selected
In ADC mode, these bits are don't care </description>
	<bitRange>[9:8]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>PID</name>
	<description>See P00_MODE_REG[PID] </description>
	<bitRange>[5:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>P46_MODE_REG</name>
	<description>P46 Mode Register</description>
	<addressOffset>0x0000006a</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000200</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>PPOD</name>
	<description>0: Push pull
1: Open drain</description>
	<bitRange>[10:10]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>PUPD</name>
	<description>00 = Input, no resistors selected
01 = Input, pull-up selected
10 = Input, pull-down selected
11 = Output, no resistors selected
In ADC mode, these bits are don't care </description>
	<bitRange>[9:8]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>PID</name>
	<description>See P00_MODE_REG[PID] </description>
	<bitRange>[5:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>P47_MODE_REG</name>
	<description>P47 Mode Register</description>
	<addressOffset>0x0000006c</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000200</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>PPOD</name>
	<description>0: Push pull
1: Open drain</description>
	<bitRange>[10:10]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>PUPD</name>
	<description>00 = Input, no resistors selected
01 = Input, pull-up selected
10 = Input, pull-down selected
11 = Output, no resistors selected
In ADC mode, these bits are don't care </description>
	<bitRange>[9:8]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>PID</name>
	<description>See P00_MODE_REG[PID] </description>
	<bitRange>[5:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>P4_DATA_REG</name>
	<description>P4 Data input / output Register</description>
	<addressOffset>0x00000008</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>P4_DATA</name>
	<description>Set P4 output register when written; Returns the value of P4 port when read </description>
	<bitRange>[7:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>P4_PADPWR_CTRL_REG</name>
	<description>P4 Output Power Control Register</description>
	<addressOffset>0x000000c8</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>P4_OUT_CTRL</name>
	<description>1 = P4_x port output is powered by VDD1V8P rail
0 = P4_x port output is powered by V33 rail
bit x controls the power supply of P4[x]</description>
	<bitRange>[7:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>P4_RESET_DATA_REG</name>
	<description>P4 Reset port pins Register</description>
	<addressOffset>0x0000001c</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>P4_RESET</name>
	<description>Writing a 1 to P4[y] sets P4[y] to 0. Writing 0 is discarded;
Reading returns 0</description>
	<bitRange>[7:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>P4_SET_DATA_REG</name>
	<description>P4 Set port pins Register</description>
	<addressOffset>0x00000012</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>P4_SET</name>
	<description>Writing a 1 to P4[y] sets P4[y] to 1. Writing 0 is discarded; Reading returns 0</description>
	<bitRange>[7:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>GPREG</name>
	<version>1.0</version>
	<description>GPREG registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50003300</baseAddress>
	<size>0</size>
	<addressBlock>
	<offset>0</offset>
	<size>26</size>
	<usage>registers</usage>
</addressBlock>
	
