nguyentri/da-pac/svd/DA14680.svd
	<description>'1' GPIO is enable for row or column</description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>KBSCN_ROW</name>
	<description>'1' GPIO is row, '0' GPIO is column</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>KBSCN_MODE</name>
	<description>Defines the row/column index that has to be connected</description>
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>KBSCN_P33_MODE_REG</name>
	<description>Defines the keyboard mode for P33</description>
	<addressOffset>0x00000042</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000007f</resetMask>
	<fields><field>
	<name>KBSCN_GPIO_EN</name>
	<description>'1' GPIO is enable for row or column</description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>KBSCN_ROW</name>
	<description>'1' GPIO is row, '0' GPIO is column</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>KBSCN_MODE</name>
	<description>Defines the row/column index that has to be connected</description>
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>KBSCN_P34_MODE_REG</name>
	<description>Defines the keyboard mode for P34</description>
	<addressOffset>0x00000044</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000007f</resetMask>
	<fields><field>
	<name>KBSCN_GPIO_EN</name>
	<description>'1' GPIO is enable for row or column</description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>KBSCN_ROW</name>
	<description>'1' GPIO is row, '0' GPIO is column</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>KBSCN_MODE</name>
	<description>Defines the row/column index that has to be connected</description>
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>KBSCN_P35_MODE_REG</name>
	<description>Defines the keyboard mode for P35</description>
	<addressOffset>0x00000046</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000007f</resetMask>
	<fields><field>
	<name>KBSCN_GPIO_EN</name>
	<description>'1' GPIO is enable for row or column</description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>KBSCN_ROW</name>
	<description>'1' GPIO is row, '0' GPIO is column</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>KBSCN_MODE</name>
	<description>Defines the row/column index that has to be connected</description>
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>KBSCN_P36_MODE_REG</name>
	<description>Defines the keyboard mode for P36</description>
	<addressOffset>0x00000048</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000007f</resetMask>
	<fields><field>
	<name>KBSCN_GPIO_EN</name>
	<description>'1' GPIO is enable for row or column</description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>KBSCN_ROW</name>
	<description>'1' GPIO is row, '0' GPIO is column</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>KBSCN_MODE</name>
	<description>Defines the row/column index that has to be connected</description>
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>KBSCN_P37_MODE_REG</name>
	<description>Defines the keyboard mode for P37</description>
	<addressOffset>0x0000004a</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000007f</resetMask>
	<fields><field>
	<name>KBSCN_GPIO_EN</name>
	<description>'1' GPIO is enable for row or column</description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>KBSCN_ROW</name>
	<description>'1' GPIO is row, '0' GPIO is column</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>KBSCN_MODE</name>
	<description>Defines the row/column index that has to be connected</description>
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>KBSCN_P40_MODE_REG</name>
	<description>Defines the keyboard mode for P40</description>
	<addressOffset>0x0000004c</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000007f</resetMask>
	<fields><field>
	<name>KBSCN_GPIO_EN</name>
	<description>'1' GPIO is enable for row or column</description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>KBSCN_ROW</name>
	<description>'1' GPIO is row, '0' GPIO is column</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>KBSCN_MODE</name>
	<description>Defines the row/column index that has to be connected</description>
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>KBSCN_P41_MODE_REG</name>
	<description>Defines the keyboard mode for P41</description>
	<addressOffset>0x0000004e</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000007f</resetMask>
	<fields><field>
	<name>KBSCN_GPIO_EN</name>
	<description>'1' GPIO is enable for row or column</description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>KBSCN_ROW</name>
	<description>'1' GPIO is row, '0' GPIO is column</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>KBSCN_MODE</name>
	<description>Defines the row/column index that has to be connected</description>
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>KBSCN_P42_MODE_REG</name>
	<description>Defines the keyboard mode for P42</description>
	<addressOffset>0x00000050</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000007f</resetMask>
	<fields><field>
	<name>KBSCN_GPIO_EN</name>
	<description>'1' GPIO is enable for row or column</description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>KBSCN_ROW</name>
	<description>'1' GPIO is row, '0' GPIO is column</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>KBSCN_MODE</name>
	<description>Defines the row/column index that has to be connected</description>
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>KBSCN_P43_MODE_REG</name>
	<description>Defines the keyboard mode for P43</description>
	<addressOffset>0x00000052</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000007f</resetMask>
	<fields><field>
	<name>KBSCN_GPIO_EN</name>
	<description>'1' GPIO is enable for row or column</description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>KBSCN_ROW</name>
	<description>'1' GPIO is row, '0' GPIO is column</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>KBSCN_MODE</name>
	<description>Defines the row/column index that has to be connected</description>
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>KBSCN_P44_MODE_REG</name>
	<description>Defines the keyboard mode for P44</description>
	<addressOffset>0x00000054</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000007f</resetMask>
	<fields><field>
	<name>KBSCN_GPIO_EN</name>
	<description>'1' GPIO is enable for row or column</description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>KBSCN_ROW</name>
	<description>'1' GPIO is row, '0' GPIO is column</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>KBSCN_MODE</name>
	<description>Defines the row/column index that has to be connected</description>
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>KBSCN_P45_MODE_REG</name>
	<description>Defines the keyboard mode for P45</description>
	<addressOffset>0x00000056</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000007f</resetMask>
	<fields><field>
	<name>KBSCN_GPIO_EN</name>
	<description>'1' GPIO is enable for row or column</description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>KBSCN_ROW</name>
	<description>'1' GPIO is row, '0' GPIO is column</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>KBSCN_MODE</name>
	<description>Defines the row/column index that has to be connected</description>
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>KBSCN_P46_MODE_REG</name>
	<description>Defines the keyboard mode for P46</description>
	<addressOffset>0x00000058</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000007f</resetMask>
	<fields><field>
	<name>KBSCN_GPIO_EN</name>
	<description>'1' GPIO is enable for row or column</description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>KBSCN_ROW</name>
	<description>'1' GPIO is row, '0' GPIO is column</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>KBSCN_MODE</name>
	<description>Defines the row/column index that has to be connected</description>
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>KBSCN_P47_MODE_REG</name>
	<description>Defines the keyboard mode for P47</description>
	<addressOffset>0x0000005a</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000007f</resetMask>
	<fields><field>
	<name>KBSCN_GPIO_EN</name>
	<description>'1' GPIO is enable for row or column</description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>KBSCN_ROW</name>
	<description>'1' GPIO is row, '0' GPIO is column</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>KBSCN_MODE</name>
	<description>Defines the row/column index that has to be connected</description>
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>KBSCN_STATUS_REG</name>
	<description>keyboard scanner Interrupt status register</description>
	<addressOffset>0x00000008</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000001ff</resetMask>
	<fields><field>
	<name>KBSCN_FIFO_UNDERFL</name>
	<description>'1' Fifo Underflow occurred</description>
	<bitRange>[8:8]</bitRange>
	<access>read-only</access>
	</field>
	<field>
	<name>KBSCN_FIFO_OVERFL</name>
	<description>'1' Fifo Overflow occurred</description>
	<bitRange>[7:7]</bitRange>
	<access>read-only</access>
	</field>
	<field>
	<name>KBSCN_NUM_MESSAGE</name>
	<description>Defines how many messages there are in the fifo.</description>
	<bitRange>[6:2]</bitRange>
	<access>read-only</access>
	</field>
	<field>
	<name>KBSCN_INACTIVE_IRQ_STATUS</name>
	<description>There is no keyboard activity for a predefined time</description>
	<bitRange>[1:1]</bitRange>
	<access>read-only</access>
	</field>
	<field>
	<name>KBSCN_MES_IRQ_STATUS</name>
	<description>There is at least one last message in the fifo. </description>
	<bitRange>[0:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>OTPC</name>
	<version>1.0</version>
	<description>OTPC registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x07f40000</baseAddress>
	<size>0</size>
	<addressBlock>
	<offset>0</offset>
	<size>48</size>
	<usage>registers</usage>
</addressBlock>
	
