nguyentri/da-pac/svd/DA14680.svd
	<registers>
	<register>
	<name>WATCHDOG_CTRL_REG</name>
	<description>Watchdog control register.</description>
	<addressOffset>0x00000002</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>NMI_RST</name>
	<description>0 = Watchdog timer generates NMI at value 0, and WDOG (SYS) reset at &lt;=-16. Timer can be frozen /resumed using
SET_FREEZE_REG[FRZ_WDOG]/
RESET_FREEZE_REG[FRZ_WDOG].
1 = Watchdog timer generates a WDOG (SYS) reset at value 0 and can not be frozen by Software.
Note that this bit can only be set to 1 by SW and only be reset with a WDOG (SYS) reset or SW reset.
The watchdog is always frozen when the Cortex-M0 is halted in DEBUG State. </description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>WATCHDOG_REG</name>
	<description>Watchdog timer register.</description>
	<addressOffset>0x00000000</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x000000ff</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>WDOG_WEN</name>
	<description>0000.000 = Write enable for Watchdog timer
else Write disable. This filter prevents unintentional presetting the watchdog with a SW run-away. </description>
	<bitRange>[15:9]</bitRange>
	<access>write-only</access>
	</field>
	<field>
	<name>WDOG_VAL_NEG</name>
	<description>0 = Watchdog timer value is positive.
1 = Watchdog timer value is negative. </description>
	<bitRange>[8:8]</bitRange>
	<access>read-write</access>
	</field>
	<field>
	<name>WDOG_VAL</name>
	<description>Write: Watchdog timer reload value. Note that all bits 15-9 must be 0 to reload this register.
Read: Actual Watchdog timer value. Decremented by 1 every 10.24 msec. Bit 8 indicates a negative counter value. 2, 1, 0, 1FF16, 1FE16 etc. An NMI or WDOG (SYS) reset is generated under the following conditions:
If WATCHDOG_CTRL_REG[NMI_RST] = 0 then
    If WDOG_VAL = 0 -&gt; NMI (Non Maskable Interrupt)
    if WDOG_VAL = 1F016 -&gt; WDOG reset -&gt; reload FF16
If WATCHDOG_CTRL_REG[NMI_RST] = 1 then
    if WDOG_VAL &lt;= 0 -&gt; WDOG reset -&gt; reload FF16 </description>
	<bitRange>[7:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register></registers>
<interrupt>
	<name>BLE_WAKEUP_LP</name>
	<value>0</value>
</interrupt><interrupt>
	<name>BLE_GEN</name>
	<value>1</value>
</interrupt><interrupt>
	<name>FTDF_WAKEUP</name>
	<value>2</value>
</interrupt><interrupt>
	<name>FTDF_GEN</name>
	<value>3</value>
</interrupt><interrupt>
	<name>RFCAL</name>
	<value>4</value>
</interrupt><interrupt>
	<name>COEX</name>
	<value>5</value>
</interrupt><interrupt>
	<name>CRYPTO</name>
	<value>6</value>
</interrupt><interrupt>
	<name>MRM</name>
	<value>7</value>
</interrupt><interrupt>
	<name>UART</name>
	<value>8</value>
</interrupt><interrupt>
	<name>UART2</name>
	<value>9</value>
</interrupt><interrupt>
	<name>I2C</name>
	<value>10</value>
</interrupt><interrupt>
	<name>I2C2</name>
	<value>11</value>
</interrupt><interrupt>
	<name>SPI</name>
	<value>12</value>
</interrupt><interrupt>
	<name>SPI2</name>
	<value>13</value>
</interrupt><interrupt>
	<name>ADC</name>
	<value>14</value>
</interrupt><interrupt>
	<name>KEYBRD</name>
	<value>15</value>
</interrupt><interrupt>
	<name>IRGEN</name>
	<value>16</value>
</interrupt><interrupt>
	<name>WKUP_GPIO</name>
	<value>17</value>
</interrupt><interrupt>
	<name>SWTIM0</name>
	<value>18</value>
</interrupt><interrupt>
	<name>SWTIM1</name>
	<value>19</value>
</interrupt><interrupt>
	<name>QUADEC</name>
	<value>20</value>
</interrupt><interrupt>
	<name>USB</name>
	<value>21</value>
</interrupt><interrupt>
	<name>PCM</name>
	<value>22</value>
</interrupt><interrupt>
	<name>SRC_IN</name>
	<value>23</value>
</interrupt><interrupt>
	<name>SRC_OUT</name>
	<value>24</value>
</interrupt><interrupt>
	<name>VBUS</name>
	<value>25</value>
</interrupt><interrupt>
	<name>DMA</name>
	<value>26</value>
</interrupt><interrupt>
	<name>RF_DIAG</name>
	<value>27</value>
</interrupt><interrupt>
	<name>TRNG</name>
	<value>28</value>
</interrupt><interrupt>
	<name>DCDC</name>
	<value>29</value>
</interrupt><interrupt>
	<name>XTAL16RDY</name>
	<value>30</value>
</interrupt><interrupt>
	<name>RESERVED31</name>
	<value>31</value>
</interrupt>
</peripheral></peripherals>
</device>
